sti_and_examples.s
# define CHAR_BIT	8
# define CHAR_MIN	–128
# define CHAR_MAX	127
# define UCHAR_MAX	255
# define SHRT_MIN	–32768
# define SHRT_MAX	32767
# define USHRT_MAX	65535
# define INT_MIN	–2147483648
# define INT_MAX	2147483647
# define UINT_MAX	4294967295
# define _I64_MIN	-9223372036854775808
# define _I64_MAX	9223372036854775807
# define _UI64_MAX	18446744073709551615


Не ясно, как именно работает T_IND на виртуальной машине

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//	ld(1, 2) -	принимает 2 аргумента. записывает первый аргумент в регистр.
	Its opcode is 10 in binary and it will change the carry
	
	ld(1, 2) -	Take a random argument and a registry. Load the value of the first argument in the registry. 
	Its opcode is 10 in binary and it will change the carry.

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

код функции = 0x02
T_REG (r)- ячейка регистра под номером
T_DIR (%)- воспримимает как обычное число(не как ссылку на ячейку)
T_IND ( )- 

HEX (	BINARY CODE		 )
ld  (T_DIR | T_IND, T_REG)
ld  (	 % |	  ,    r )
0x02(   10 |    11,	  01 )

Все это кодируется в 2 байта ().
Первый байт - название функции (hex):
0x02,
Второй - какие аргументы имеем (bytecode):
	(   10 |    11,	  01 )


ПРИМЕРЫ:
=====================================================================
# BEFORE :
ld 1,r2
# OUTPUT :
02d0 0003 02

# DESCRIPTION
Функция и тип аргументов
02	- 0000 0010(в байт коде) код функции
d0	- 11 01 00 00(в байт коде) какие аргументы принимаем
Сами аргументы
0003 - хз почему так (T_DIR кодируется в 2 байта)
02	 - второй регистр(T_REG кодируется в 1 байт)
=====================================================================

=====================================================================
# BEFORE :
ld %1,r2
# OUTPUT :
0290 0000 0001 02

# DESCRIPTION
Функция и тип аргументов
02	- 0000 0010(в байт коде) код функции
d0	- 10 01 00 00(в байт коде) какие аргументы принимаем
Сами аргументы
0000 0001 - 		  (T_IND кодируется в 4 байта)
02	 - второй регистр (T_REG кодируется в 1 байт)
=====================================================================

