sti_and_examples.s
# define CHAR_BIT	8
# define CHAR_MIN	–128
# define CHAR_MAX	127
# define UCHAR_MAX	255
# define SHRT_MIN	–32768
# define SHRT_MAX	32767
# define USHRT_MAX	65535
# define INT_MIN	–2147483648
# define INT_MAX	2147483647
# define UINT_MAX	4294967295
# define _I64_MIN	-9223372036854775808
# define _I64_MAX	9223372036854775807
# define _UI64_MAX	18446744073709551615

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

// ld(1, 2) -	(косвенная загрузка) значение в 1 аргументе % IDX_MOD записывается в регистр указаный
				во 2 аргументе (запись в регист)

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

=====================================================================
## func ld gives 4 bytes for each argv
l2:	ld %4294967295,r2
	aff r2
## Output 
02 90 ffff ffff 02
10 40 02 

#LIKE/////////////////////////////////////////////////////////////////

=====================================================================
