# define CHAR_BIT	8
# define CHAR_MIN	–128
# define CHAR_MAX	127
# define UCHAR_MAX	255
# define SHRT_MIN	–32768
# define SHRT_MAX	32767
# define USHRT_MAX	65535
# define INT_MIN	–2147483648
# define INT_MAX	2147483647
# define UINT_MAX	4294967295
# define _I64_MIN	-9223372036854775808
# define _I64_MAX	9223372036854775807
# define _UI64_MAX	18446744073709551615

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//	st(1, 2) - 2 аргумента. берет зачение из первого аргумента и записывает во второй(регистр или ячейку)
		

//	st: take a registry and a registry or an indirect and store the value of the registry 
		toward a second argument. Its opcode is 0x03. For example, st r1, 42 store the 
		value of r1 at the address (PC + (42 % IDX_MOD))
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

код функции = 0x03
T_REG (r)- ячейка регистра под номером
T_DIR (%)- воспримимает как обычное число(не как ссылку на ячейку)
T_IND ( )- 

HEX (	BINARY CODE		 )
st (T_REG, T_IND  | T_REG)
st (	r,	   	  |	    r)
0x03(  01,	   11 |    01).

Все это кодируется в 2 байта ().
Первый байт - название функции:
0x03,
Второй - какие аргументы имеем:
	(  01,	   11 |    01).


ПРИМЕРЫ:
=====================================================================
# BEFORE :
st r1, r2
# OUTPUT :
0350 0102

# DESCRIPTION
Функция и тип аргументов
03 - 0000 0011(в байт коде) код функции
68 - 01 01 00 00(в байт коде) какие аргументы принимаем
Сами аргументы
01		- 1-й регистр 0000 0001(в байт коде) кодируется в 1 байт
02		- 2-й регистр 0000 0010(в байт коде) кодируется в 1 байт
=====================================================================

=====================================================================
# BEFORE :
st r2, 15
# OUTPUT :
0370 0200 0f

# DESCRIPTION
Функция и тип аргументов
03 - 0000 0011(в байт коде) код функции
70 - 01 11 00 00(в байт коде) какие аргументы принимаем
Сами аргументы
02		- 2-й регистр 0000 0010(в байт коде) кодируется в 1 байт
00 0f	- 15, 2 байта
=====================================================================