#include <ncurses.h>

int main()
{
    initscr();                  	// Переход в curses-режим
    printw("Hello world!\n");	 	// Отображение приветствия в буфер

    //Вывод символа "А" в обычном режиме
    printw("**************************************************************************************************************************************************************************************************************************************************************"); 
    addch('A');

    //Вывод подчёркнутого и жирного символа "А"
    printw("\nUnderline and bold symbol \'A\': ");
    addch('A' | A_BOLD | A_UNDERLINE);
    refresh();                   	// Вывод приветствия на настоящий экран
    getch();                    	// Ожидание нажатия какой-либо клавиши пользователем
    endwin();                   	// Выход из curses-режима. Обязательная команда.
    return 0;
}